# GetNumStoryLayerTemplates

## Description
Returns the number of story layer templates in the file. Story Layer Templates are used to define what Layers are typically found in a Story. When a Story is created, the user has the option to automatically create the Layers defined by the Story Layer Templates.

```pascal
FUNCTION GetNumStoryLayerTemplates : INTEGER;
```

```python

def vs.GetNumStoryLayerTemplates():
    return INTEGER
```

## Returns
The number of Story Layer Templates in the file.

## See Also
VS Functions:
CreateStoryLayerTemplate

## Version
Availability: from Vectorworks 2012
## Category
* Layers